src/main/resources/sampleXmls/IDService.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://predic8.com/wsdl/IDService/1/">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:generate>?</ns:generate>
   </soapenv:Body>
</soapenv:Envelope>